Repository: Tyaran-dev/tayyran-app
Catalog: assets/locales/app_*.arb
Languages: ar

# appTitle
source: Tayyran
ar: طيران

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Get Started
ar: ابدأ الآن

source: Confirm
ar: تأكيد

source: Search
ar: بحث

source: Clear All
ar: مسح الكل

source: Error
ar: خطأ

source: Retry
ar: إعادة المحاولة

source: Loading
ar: جاري التحميل

# onboardingTitle1
source: Ready to Fly?
ar: مستعد للطيران؟

# onboardingDesc1
source: Find and book your perfect flight. Search by destination, date, and price. Let's get you there!
ar: ابحث واحجز رحلتك المثالية. ابحث حسب الوجهة، التاريخ، والسعر. لنوصلك إلى هناك!

# onboardingTitle2
source: Customize Your Stay
ar: خصص إقامتك

# onboardingDesc2
source: Personalize your booking and enjoy a more comfortable and convenient hotel stay.
ar: personalize حجزك واستمتع بإقامة فندقية أكثر راحة وسهولة.

# onboardingTitle3
source: Connecting with You
ar: نتواصل معك

# onboardingDesc3
source: We've become a trusted name in travel, dedicated to providing exceptional service and support.
ar: أصبحنا اسمًا موثوقًا في السفر، ملتزمين بتقديم خدمة ودعم استثنائيين.

source: Current location
ar: الموقع الحالي

# fetchingLocation
source: Fetching...
ar: جاري التحميل...

source: Stay
ar: الإقامة

source: Flight
ar: الطيران

source: One-way
ar: ذهاب

source: Round-trip
ar: ذهاب وعودة

source: Multi-city
ar: متعدد المدن

source: From
ar: من

source: To
ar: إلى

source: Departure
ar: مغادرة

source: Return
ar: عودة

source: Passengers
ar: ركاب

source: Search Flights
ar: ابحث عن رحلات

source: Recent Search
ar: عمليات البحث الأخيرة

source: No recent searches
ar: لا توجد عمليات بحث حديثة

source: Passengers & Cabin Class
ar: الركاب وفئة المقصورة

source: Adults
ar: بالغين

# adultsAge
source: Age 12+
ar: 12+ سنة

source: Children
ar: أطفال

# childrenAge
source: Age 2-11
ar: 2-11 سنة

source: Infants
ar: رضع

# infantsAge
source: Under 2 years
ar: أقل من سنتين

source: Cabin Class
ar: فئة المقصورة

# economyClass
source: Economy
ar: اقتصادية

# economyDesc
source: The standard seating option
ar: خيار المقاعد القياسي

source: Premium Economy
ar: اقتصادية متميزة

# premiumEconomyDesc
source: More legroom and amenities
ar: مساحة أكبر للقدمين ومرافق أكثر

# businessClass
source: Business
ar: رجال الأعمال

# businessDesc
source: Premium service and comfort
ar: خدمة متميزة وراحة

# firstClass
source: First
ar: الأولى

# firstDesc
source: The most luxurious experience
ar: أكثر تجربة فاخرة

source: Select Origin
ar: اختر نقطة الانطلاق

source: Select Destination
ar: اختر الوجهة

source: Search airports...
ar: ابحث عن المطارات...

source: No airports found
ar: لم يتم العثور على مطارات

source: Home
ar: الرئيسية

source: Bookings
ar: الحجوزات

source: Discounts
ar: العروض

source: Profile
ar: الملف الشخصي

# searchError
source: Please fill all required fields
ar: يرجى ملء جميع الحقول المطلوبة

# networkError
source: Failed to load app. Please check your connection and try again.
ar: فشل تحميل التطبيق. يرجى التحقق من اتصالك وإعادة المحاولة.

# preferencesError
source: Failed to save preferences. Please try again.
ar: فشل حفظ التفضيلات. يرجى المحاولة مرة أخرى.

# flightSearchError
source: Failed to search flights. Please try again.
ar: فشل البحث عن الرحلات. يرجى المحاولة مرة أخرى.

# DXB
source: Dubai International
ar: مطار دبي الدولي

# AUH
source: Abu Dhabi International
ar: مطار أبوظبي الدولي

# SHJ
source: Sharjah International
ar: مطار الشارقة الدولي

# DOH
source: Hamad International
ar: مطار حمد الدولي

# RUH
source: King Khalid International
ar: مطار الملك خالد الدولي

# JED
source: King Abdulaziz International
ar: مطار الملك عبدالعزيز الدولي

# LHR
source: London Heathrow
ar: مطار لندن هيثرو

# CDG
source: Paris Charles de Gaulle
ar: مطار باريس شارل ديغول

# JFK
source: John F. Kennedy International
ar: مطار جون إف كينيدي الدولي
